Repository: userlethekhoi/3012
Catalog: 3012/Resources/Localizable.xcstrings
Source language: en
Languages: vi, zh_hans

source: 3012 currently writes only inside folders explicitly selected through Files.
vi: 3012 hiện chỉ ghi bên trong thư mục được người dùng chọn rõ ràng qua Files.
zh_hans: 3012 目前仅写入用户通过“文件”明确选择的文件夹。

source: Access
vi: Quyền truy cập
zh_hans: 访问

source: Adjust text and controls across 3012.
vi: Điều chỉnh chữ và control trên toàn bộ 3012.
zh_hans: 调整整个 3012 中的文字和控件大小。

source: Architecture
vi: Kiến trúc
zh_hans: 架构

source: Available Now
vi: Hiện có
zh_hans: 当前可用

source: Build
vi: Bản dựng
zh_hans: 构建版本

source: Checking direct app-container access.
vi: Đang kiểm tra quyền truy cập trực tiếp container ứng dụng.
zh_hans: 正在检查应用容器直接访问权限。

source: Compatibility checks passed, but the container provider could not be activated. Check the signing identity and session log.
vi: Kiểm tra tương thích đã đạt nhưng không thể kích hoạt provider container. Hãy kiểm tra định danh chữ ký và nhật ký phiên.
zh_hans: 兼容性检查已通过，但无法激活容器提供程序。请检查签名标识和会话日志。

source: Copy
vi: Sao chép
zh_hans: 复制

source: Device
vi: Thiết bị
zh_hans: 设备

source: Direct app-container browsing will appear only when a verified provider is available.
vi: Duyệt trực tiếp container ứng dụng chỉ xuất hiện khi có provider đã được xác minh.
zh_hans: 仅在经过验证的提供程序可用时，才会显示直接浏览应用容器的功能。

source: Direct app-container access is not supported on this iOS build. Manual patching through Files is still available.
vi: Bản dựng iOS này không hỗ trợ truy cập trực tiếp container ứng dụng. Patch thủ công qua Files vẫn khả dụng.
zh_hans: 此 iOS 构建不支持直接访问应用容器。仍可通过“文件”手动修补。

source: Done
vi: Xong
zh_hans: 完成

source: Downloads
vi: Tải xuống
zh_hans: 下载

source: Export
vi: Xuất
zh_hans: 导出

source: Files
vi: Tệp
zh_hans: 文件

source: Home
vi: Trang chủ
zh_hans: 主页

source: Installed & Restore
vi: Đã cài & Khôi phục
zh_hans: 已安装与恢复

source: Interface Size
vi: Kích thước giao diện
zh_hans: 界面大小

source: Larger
vi: Lớn hơn
zh_hans: 放大

source: Limited Access
vi: Quyền truy cập hạn chế
zh_hans: 受限访问

source: Manual Patch
vi: Patch thủ công
zh_hans: 手动补丁

source: Manual patching through Files is available. Direct app-container access is not enabled in this build.
vi: Có thể patch thủ công qua Files. Bản dựng này chưa bật quyền truy cập trực tiếp container ứng dụng.
zh_hans: 可通过“文件”进行手动补丁。本构建尚未启用直接访问应用容器。

source: Model
vi: Mã thiết bị
zh_hans: 设备型号

source: Name
vi: Tên
zh_hans: 名称

source: No production catalog is configured yet.
vi: Chưa cấu hình catalog production.
zh_hans: 尚未配置生产目录。

source: No Session Logs
vi: Chưa có nhật ký phiên
zh_hans: 暂无会话日志

source: Online Catalog
vi: Catalog online
zh_hans: 在线目录

source: Open Manual Patch
vi: Mở patch thủ công
zh_hans: 打开手动补丁

source: Patch Sources
vi: Nguồn patch
zh_hans: 补丁来源

source: Patches
vi: Bản vá
zh_hans: 补丁

source: Runtime diagnostics will appear here. Sensitive values are redacted before storage.
vi: Chẩn đoán runtime sẽ xuất hiện tại đây. Giá trị nhạy cảm được che trước khi lưu.
zh_hans: 运行时诊断将显示在此处。敏感值会在存储前被遮盖。

source: Reset to 100%
vi: Đặt lại 100%
zh_hans: 重置为 100%

source: Select a folder through the iOS Files picker to grant 3012 access. Direct app-container browsing will appear only when a verified provider is available.
vi: Chọn một thư mục qua trình chọn Files của iOS để cấp quyền cho 3012. Duyệt trực tiếp container ứng dụng chỉ xuất hiện khi có provider đã xác minh.
zh_hans: 通过 iOS“文件”选择器选择文件夹以授予 3012 访问权限。仅在经过验证的提供程序可用时，才会显示直接浏览应用容器的功能。

source: Session Logs
vi: Nhật ký phiên
zh_hans: 会话日志

source: Smaller
vi: Nhỏ hơn
zh_hans: 缩小

source: Settings
vi: Cài đặt
zh_hans: 设置

source: Standard Files Access
vi: Quyền Files tiêu chuẩn
zh_hans: 标准文件访问

source: Supported
vi: Được hỗ trợ
zh_hans: 受支持

source: System
vi: Hệ thống
zh_hans: 系统

source: This build does not include direct app-container access. Use the Device Access IPA.
vi: Bản dựng này không gồm quyền truy cập trực tiếp container ứng dụng. Hãy dùng IPA Device Access.
zh_hans: 此构建不包含应用容器直接访问功能。请使用 Device Access IPA。

source: Unavailable
vi: Không khả dụng
zh_hans: 不可用

source: Use large local files without uploading them to a server.
vi: Dùng file lớn trên máy mà không cần tải lên server.
zh_hans: 使用大型本地文件，无需上传到服务器。

source: 3012 does not include advertising, telemetry, or an AI runtime.
vi: 3012 không tích hợp quảng cáo, telemetry hoặc AI runtime.
zh_hans: 3012 不包含广告、遥测或 AI 运行时。

source: 3012 restores only when the current file still matches the patched version, preventing newer changes from being overwritten.
vi: 3012 chỉ khôi phục khi file hiện tại vẫn khớp bản đã patch, tránh ghi đè thay đổi mới hơn.
zh_hans: 仅当当前文件仍与已修补版本匹配时，3012 才会恢复，以免覆盖较新的更改。

source: 3012 verifies every file and creates a journal and backup before changing the target folder.
vi: 3012 xác minh mọi file, tạo journal và backup trước khi thay đổi thư mục đích.
zh_hans: 3012 会在更改目标文件夹前验证每个文件，并创建日志和备份。

source: 3012 writes only inside the folder selected through Files. Choose the correct root folder so the relative paths below match exactly.
vi: 3012 chỉ ghi trong thư mục được chọn qua Files. Hãy chọn đúng thư mục gốc để các đường dẫn tương đối bên dưới khớp chính xác.
zh_hans: 3012 仅写入通过“文件”选择的文件夹。请选择正确的根文件夹，使下面的相对路径完全匹配。

source: Activity
vi: Hoạt động
zh_hans: 活动

source: Add Replacement Files
vi: Thêm file thay thế
zh_hans: 添加替换文件

source: Appearance
vi: Giao diện
zh_hans: 外观

source: Author
vi: Tác giả
zh_hans: 作者

source: Available
vi: Khả dụng
zh_hans: 可用

source: BACKED UP
vi: ĐÃ BACKUP
zh_hans: 已备份

source: Back Up and Patch
vi: Tạo backup và patch
zh_hans: 备份并修补

source: Background Downloads
vi: Tải nền
zh_hans: 后台下载

source: Beta
vi: Thử nghiệm
zh_hans: 测试版

source: Cancel
vi: Hủy
zh_hans: 取消

source: Catalog Channel
vi: Kênh catalog
zh_hans: 目录通道

source: Catalog Trust
vi: Xác minh catalog
zh_hans: 目录信任

source: Choose a Folder to Patch
vi: Chọn thư mục được phép patch
zh_hans: 选择要修补的文件夹

source: Close
vi: Đóng
zh_hans: 关闭

source: Completed
vi: Hoàn tất
zh_hans: 已完成

source: Confirm Manual Patch
vi: Xác nhận patch thủ công
zh_hans: 确认手动补丁

source: Create New File
vi: Tạo file mới
zh_hans: 创建新文件

source: Dark
vi: Tối
zh_hans: 深色

source: Delete
vi: Xóa
zh_hans: 删除

source: Do not close the app or disconnect Files while patching. If a step fails, the transaction rolls back files already changed.
vi: Không đóng app hoặc ngắt kết nối Files khi đang patch. Nếu một bước thất bại, transaction sẽ rollback các file đã thay đổi.
zh_hans: 修补时请勿关闭应用或断开“文件”。如果某一步失败，事务会回滚已更改的文件。

source: Downloading
vi: Đang tải
zh_hans: 正在下载

source: Failed
vi: Lỗi
zh_hans: 失败

source: File Count
vi: Số file
zh_hans: 文件数量

source: Information
vi: Thông tin
zh_hans: 信息

source: Import Package
vi: Nhập package
zh_hans: 导入软件包

source: Language
vi: Ngôn ngữ
zh_hans: 语言

source: Large files are streamed in chunks. The app creates a temporary package, verifies SHA-256, backs up originals, and removes the temporary package when finished.
vi: File lớn được đọc theo từng khối. App tạo package tạm, xác minh SHA-256, backup file gốc và xóa package tạm khi hoàn tất.
zh_hans: 大文件会分块流式处理。应用会创建临时软件包、验证 SHA-256、备份原文件，并在完成后删除临时软件包。

source: Light
vi: Sáng
zh_hans: 浅色

source: Local · No Server Upload
vi: Cục bộ · Không tải lên server
zh_hans: 本地 · 不上传服务器

source: Mode
vi: Chế độ
zh_hans: 模式

source: No Downloads
vi: Không có lượt tải
zh_hans: 暂无下载

source: No Installed Patches
vi: Chưa có patch đã cài
zh_hans: 暂无已安装补丁

source: Not Configured
vi: Chưa cấu hình
zh_hans: 未配置

source: Operation
vi: Thao tác
zh_hans: 操作

source: Package Import Failed
vi: Không thể nhập package
zh_hans: 软件包导入失败

source: Package Preview
vi: Xem trước package
zh_hans: 软件包预览

source: Packages being downloaded, paused, or verified will be managed here.
vi: Các package đang tải, tạm dừng hoặc chờ xác minh sẽ được quản lý tại đây.
zh_hans: 正在下载、暂停或验证的软件包将在此管理。

source: Patch Files
vi: File patch
zh_hans: 补丁文件

source: Patch Name
vi: Tên patch
zh_hans: 补丁名称

source: Patching…
vi: Đang patch…
zh_hans: 正在修补…

source: Pause
vi: Tạm dừng
zh_hans: 暂停

source: Paused
vi: Đã tạm dừng
zh_hans: 已暂停

source: Payload Size
vi: Dung lượng payload
zh_hans: 载荷大小

source: Publisher
vi: Nhà phát hành
zh_hans: 发布者

source: Queued
vi: Đang chờ
zh_hans: 排队中

source: Relative path, for example Documents/file.bin
vi: Đường dẫn tương đối, ví dụ Documents/file.bin
zh_hans: 相对路径，例如 Documents/file.bin

source: Remove File
vi: Bỏ file
zh_hans: 移除文件

source: Replace Existing File
vi: Thay file có sẵn
zh_hans: 替换现有文件

source: Restore
vi: Khôi phục
zh_hans: 恢复

source: Restore Failed
vi: Không thể khôi phục
zh_hans: 恢复失败

source: Restore Original Files
vi: Khôi phục file gốc
zh_hans: 恢复原始文件

source: Restore Original Files?
vi: Khôi phục file gốc?
zh_hans: 恢复原始文件？

source: Resume
vi: Tiếp tục
zh_hans: 继续

source: Retry
vi: Thử lại
zh_hans: 重试

source: Stable
vi: Ổn định
zh_hans: 稳定版

source: Standard Files access is unavailable on this device.
vi: Quyền Files tiêu chuẩn không khả dụng trên thiết bị này.
zh_hans: 此设备无法使用标准文件访问。

source: Target Folder
vi: Thư mục đích
zh_hans: 目标文件夹

source: This preview is not signature verification. A package can be applied only after a production public key is configured and every SHA-256 digest is valid.
vi: Phần xem trước không phải xác minh chữ ký. Package chỉ được áp dụng sau khi cấu hình public key production và mọi SHA-256 đều hợp lệ.
zh_hans: 此预览并非签名验证。只有配置生产公钥且所有 SHA-256 摘要有效后，才能应用软件包。

source: Unknown Error
vi: Lỗi không xác định
zh_hans: 未知错误

source: Updates
vi: Cập nhật
zh_hans: 更新

source: Verified installed patches will appear here with backup and restore status.
vi: Patch đã xác minh và cài đặt sẽ xuất hiện tại đây cùng trạng thái backup và khôi phục.
zh_hans: 已验证并安装的补丁将在此显示，并附带备份和恢复状态。

source: Verify and Patch
vi: Kiểm tra và patch
zh_hans: 验证并修补

source: Verifying
vi: Đang xác minh
zh_hans: 正在验证

source: Version
vi: Phiên bản
zh_hans: 版本

# error.backgroundTaskMissing
source: The background task no longer exists.
vi: Tác vụ nền không còn tồn tại.
zh_hans: 后台任务已不存在。

# error.bookmarkUnavailable
source: File or folder access could not be saved.
vi: Không thể lưu quyền truy cập file hoặc thư mục.
zh_hans: 无法保存文件或文件夹访问权限。

# error.historySaveFailed
source: The patch completed, but its history could not be saved: %@
vi: Patch đã hoàn tất nhưng không thể lưu lịch sử: %@
zh_hans: 补丁已完成，但无法保存历史记录：%@

# error.insufficientStorage
source: Not enough free space. About %@ is required; %@ is available.
vi: Không đủ dung lượng trống. Cần khoảng %@; hiện có %@.
zh_hans: 可用空间不足。大约需要 %@；当前可用 %@。

# error.invalidRelativePath
source: Invalid path: %@
vi: Đường dẫn không hợp lệ: %@
zh_hans: 路径无效：%@

# error.noFiles
source: No replacement files are selected.
vi: Bạn chưa chọn file thay thế.
zh_hans: 尚未选择替换文件。

# error.packageUnreadable
source: This package could not be read. It may be malformed or exceed a safety limit.
vi: Không thể đọc package này. File có thể sai định dạng hoặc vượt giới hạn an toàn.
zh_hans: 无法读取此软件包。文件可能格式错误或超过安全限制。

# error.staleBookmark
source: Access has expired. Select the file or folder again.
vi: Quyền truy cập đã hết hạn. Hãy chọn lại file hoặc thư mục.
zh_hans: 访问权限已过期。请重新选择文件或文件夹。

# error.targetNotSelected
source: No target folder is selected.
vi: Bạn chưa chọn thư mục đích.
zh_hans: 尚未选择目标文件夹。

# status.patchCompleted
source: Patch completed. A backup was saved for restore.
vi: Patch hoàn tất. Backup đã được lưu để khôi phục.
zh_hans: 补丁已完成。已保存用于恢复的备份。

# status.restoreCompleted
source: Original files were restored.
vi: Đã khôi phục các file gốc.
zh_hans: 原始文件已恢复。

# status.restoringBackup
source: Checking and restoring the backup…
vi: Đang kiểm tra và khôi phục backup…
zh_hans: 正在检查并恢复备份…

# status.verifyingBackup
source: Verifying and creating a backup…
vi: Đang xác minh và tạo backup…
zh_hans: 正在验证并创建备份…

source: App Containers
vi: Container ứng dụng
zh_hans: 应用容器

source: Application containers are exposed read-only until device validation and transaction integration are complete.
vi: Container ứng dụng chỉ được mở ở chế độ đọc cho đến khi hoàn tất kiểm thử thiết bị và tích hợp transaction.
zh_hans: 在完成设备验证和事务集成之前，应用容器仅以只读方式公开。

source: Container Access
vi: Truy cập container
zh_hans: 容器访问

source: Container browsing is read-only in this milestone.
vi: Duyệt container chỉ đọc trong giai đoạn này.
zh_hans: 此阶段的容器浏览为只读。

source: Empty Folder
vi: Thư mục trống
zh_hans: 空文件夹

source: Folder Unavailable
vi: Không thể mở thư mục
zh_hans: 文件夹不可用

source: No visible items were found in this folder.
vi: Không tìm thấy mục hiển thị nào trong thư mục này.
zh_hans: 此文件夹中没有可见项目。

source: Read-Only Device Access
vi: Truy cập thiết bị chỉ đọc
zh_hans: 只读设备访问

source: Read-only app-container access is available.
vi: Quyền truy cập container ứng dụng chỉ đọc đã khả dụng.
zh_hans: 只读应用容器访问可用。

source: Scan App Containers
vi: Quét container ứng dụng
zh_hans: 扫描应用容器

source: Scanning Containers…
vi: Đang quét container…
zh_hans: 正在扫描容器…

# error.containerDiscoveryFailed
source: App containers could not be discovered. Check the build identity and session log.
vi: Không thể tìm container ứng dụng. Hãy kiểm tra build identity và nhật ký phiên.
zh_hans: 无法发现应用容器。请检查构建身份和会话日志。

# error.pathOutsideLease
source: The requested path is outside the active container lease.
vi: Đường dẫn yêu cầu nằm ngoài container lease đang hoạt động.
zh_hans: 请求的路径位于活动容器租约之外。

source: files
vi: file
zh_hans: 个文件

source: Follow System
vi: Theo hệ thống
zh_hans: 跟随系统

source: Signing ID
vi: ID chữ ký
zh_hans: 签名 ID

source: The Device Access IPA has an incompatible Bundle ID.
vi: IPA Device Access có Bundle ID không tương thích.
zh_hans: Device Access IPA 的 Bundle ID 不兼容。

source: Only the 3012 host container is visible; device-wide access is not active.
vi: Chỉ thấy container host của 3012; quyền truy cập toàn thiết bị chưa hoạt động.
zh_hans: 目前只能看到 3012 的宿主容器；全设备访问尚未生效。

source: The system denied access to application containers. Check signing and session logs.
vi: Hệ thống đã từ chối truy cập container ứng dụng. Hãy kiểm tra chữ ký và nhật ký phiên.
zh_hans: 系统拒绝访问应用容器。请检查签名和会话日志。

source: Found %lld readable app containers.
vi: Đã tìm thấy %lld container ứng dụng có thể đọc.
zh_hans: 找到 %lld 个可读取的应用容器。

source: No matching app containers.
vi: Không có container ứng dụng phù hợp.
zh_hans: 没有匹配的应用容器。

source: Search apps, Bundle IDs, or UUIDs
vi: Tìm app, Bundle ID hoặc UUID
zh_hans: 搜索应用、Bundle ID 或 UUID

source: Provider
zh_hans: 提供程序
